In [36]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [37]:
df=pd.read_csv("customer_data_for_ml_practice.csv")

In [38]:
df.shape

(53, 6)

In [39]:
df.head()

   CustomerID   Age  Gender   Income  SpendingScore  Purchased
0           1  25.0    Male  50000.0             60          0
1           2  30.0  Female  60000.0             80          0
2           3   NaN  Female  55000.0             75          1
3           4  45.0    Male      NaN             50          0
4           5  22.0  Female  45000.0             65          1

In [40]:
df.duplicated().sum()

np.int64(3)

In [41]:
df=df.drop_duplicates()

In [42]:
df.duplicated().sum()

np.int64(0)

In [43]:
df.isnull().sum()

CustomerID       0
Age              8
Gender           0
Income           5
SpendingScore    0
Purchased        0
dtype: int64

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   CustomerID     50 non-null     int64
 1   Age            42 non-null     float64
 2   Gender         50 non-null     object
 3   Income         45 non-null     float64
 4   SpendingScore  50 non-null     int64
 5   Purchased      50 non-null     int64
dtypes: float64(2), int64(3), object(1)
memory usage: 2.7+ KB

In [45]:
df['Age']=df['Age'].fillna(df['Age'].median())

In [46]:
df['Income']=df['Income'].fillna(df['Income'].mean())

In [47]:
df.isnull().sum()

CustomerID       0
Age              0
Gender           0
Income           0
SpendingScore    0
Purchased        0
dtype: int64

Label encoding

In [48]:


from sklearn.preprocessing import LabelEncoder
df=pd.read_csv("customer_data_for_ml_practice.csv")
df2=df.copy()
le=LabelEncoder()
df2['Gender Encoded ']=le.fit_transform(df2['Gender'])
df2['Gender Encoded '].astype(int)

0     1
1     0
2     0
3     1
4     0
5     1
6     1
7     0
8     1
9     0
10    0
11    1
12    1
13    0
14    1
15    0
16    1
17    0
18    1
19    0
20    1
21    0
22    1
23    0
24    1
25    0
26    1
27    0
28    1
29    0
30    1
31    0
32    1
33    0
34    1
35    0
36    1
37    0
38    1
39    0
40    1
41    0
42    1
43    0
44    1
45    0
46    1
47    0
48    1
49    0
50    1
51    1
52    0
Name: Gender Encoded , dtype: int64

In [49]:
df.columns

Index(['CustomerID', 'Age', 'Gender', 'Income', 'SpendingScore', 'Purchased'], dtype='object')

In [50]:
df2['Gender Encoded ']

0     1
1     0
2     0
3     1
4     0
5     1
6     1
7     0
8     1
9     0
10    0
11    1
12    1
13    0
14    1
15    0
16    1
17    0
18    1
19    0
20    1
21    0
22    1
23    0
24    1
25    0
26    1
27    0
28    1
29    0
30    1
31    0
32    1
33    0
34    1
35    0
36    1
37    0
38    1
39    0
40    1
41    0
42    1
43    0
44    1
45    0
46    1
47    0
48    1
49    0
50    1
51    1
52    0
Name: Gender Encoded , dtype: int64

In [51]:
df2.head()

,CustomerID,Age,Gender,Income,SpendingScore,Purchased,Gender Encoded
0,1,25.0,Male,50000.0,60,0,1
1,2,30.0,Female,60000.0,80,0,0
2,3,NaN,Female,55000.0,75,1,0
3,4,45.0,Male,NaN,50,0,1
4,5,22.0,Female,45000.0,65,1,0

In [53]:
X = df.drop("Purchased", axis=1)
y = df["Purchased"]

In [ ]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler
scale=StandardScaler()
x_scale=scale.fit_transform()
scale=MinMaxScaler()
x_scale=scale.fit_transform(X)

In [63]:
from sklearn.preprocessing import StandardScaler,MinMaxScaler
from sklearn.model_selection import train_test_split
data={
    'studyhours':[1,2,3,4,5],
    'performance':[20,30,40,50,60]
}
df1=pd.DataFrame(data)
StandardScale=StandardScaler()
StandardScaled=StandardScale.fit_transform(df1)
pd.DataFrame(StandardScaled,columns=['studyhours','performance'])

   studyhours  performance
0   -1.414214    -1.414214
1   -0.707107    -0.707107
2    0.000000     0.000000
3    0.707107     0.707107
4    1.414214     1.414214

In [64]:
minmaxscaler=MinMaxScaler()
minmaxscaled=minmaxscaler.fit_transform(df1)
pd.DataFrame(minmaxscaled,columns=['studyhours','performance'])

   studyhours  performance
0        0.00         0.00
1        0.25         0.25
2        0.50         0.50
3        0.75         0.75
4        1.00         1.00